"""Создать класс TrafficLight ( светофор) и определить у него один атрибут color ( цвет) и метод
running ( запуск). Атрибут реализовать как приватный. В рамках метода реализовать
переключение светофора в режимы: красный, желтый, зеленый. Продолжительность первого
состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый)
— на ваше усмотрение. Переключение между режимами должно осуществляться только в
указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр
и вызвав описанный метод."""

from time import sleep
from itertools import cycle


class TrafficLight:
    def __init__(self):
        self.__color = "цвет"

    def running(self):
        colors = cycle(['красный', 'желтый', 'зеленый'])
        for color in colors:
            if color == 'красный':
                print(f'цвет светофора {color}')
                sleep(7)
            elif color == 'желтый':
                print(f'цвет светофора {color}')
                sleep(2)
            else:
                print(f'цвет светофора {color}')
                sleep(3)


a = TrafficLight()
a.running()
